In [3]:
#concatination is a process of combining 2 or multiple DataFrames into a single DataFrame/Table
#lets look at the foloowing example
import pandas as pd

#weather conditions in india
india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})


#weather conditions in USA
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})

In [4]:
#lets check weather cndition in india
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [9]:
#lets check the weather condition in USA
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [10]:
#lets concat india_weather and us_weather by using concat method
conDF=pd.concat([india_weather,us_weather])
conDF

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [ ]:
#nice :)
#but we can notice that index is still default

In [11]:
#To ignore index we need to pass parameter 'ignore_index=True'
conDF=pd.concat([india_weather,us_weather],ignore_index=True)
conDF

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [ ]:
#concatinating data with country names
#lets India and USA
#so we must pass names=[]parameter

In [13]:
conDF=pd.concat([india_weather,us_weather],keys=['india','USA'])
conDF

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
USA   0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [ ]:
#perfect

In [16]:
#lets know the location of both countries
#india weather report
conDF.loc['india']

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [17]:
#usa weather report  
conDF.loc['USA']

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [23]:
#Assume that DataFrame has irregular indexes


temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
})
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [34]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai","banglore"],
    "windspeed": [7,12,15],
})
windspeed_df

       city  windspeed
0     delhi          7
1    mumbai         12
2  banglore         15

In [35]:
conDF=pd.concat([temperature_df,windspeed_df],axis=1)
conDF

       city  temperature      city  windspeed
0    mumbai           32     delhi          7
1     delhi           45    mumbai         12
2  banglore           30  banglore         15

In [ ]:
#we can see that index o having mumbai and delhi as wrong index 
#so to set the right index we must pass index parameter in DataFrame method
#so lets go back

In [36]:

temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
},index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [37]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai","banglore"],
    "windspeed": [7,12,15],
},index=[1,0,2])
windspeed_df

       city  windspeed
1     delhi          7
0    mumbai         12
2  banglore         15

In [38]:
conDF=pd.concat([temperature_df,windspeed_df],axis=1)
conDF

       city  temperature      city  windspeed
0    mumbai           32    mumbai         12
1     delhi           45     delhi          7
2  banglore           30  banglore         15

In [ ]:
#yes

In [40]:
#what is axis
conDF=pd.concat([temperature_df,windspeed_df])
conDF

/home/adminsys/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

       city  temperature  windspeed
0    mumbai         32.0        NaN
1     delhi         45.0        NaN
2  banglore         30.0        NaN
1     delhi          NaN        7.0
0    mumbai          NaN       12.0
2  banglore          NaN       15.0

In [41]:
#so we can see that concatination is little messy
#to combine both tables we use axis method
conDF=pd.concat([temperature_df,windspeed_df],axis=1)
conDF

       city  temperature      city  windspeed
0    mumbai           32    mumbai         12
1     delhi           45     delhi          7
2  banglore           30  banglore         15

In [42]:
#
#
#

In [45]:
#we can combine a series of data into a dataframe
event = pd.Series(["Humid","Dry","Rain"], name="event")
temp= pd.Series(['high','med','low'],name='temp')

In [47]:
conET=pd.concat([event,temp],axis=1)
conET

   event  temp
0  Humid  high
1    Dry   med
2   Rain   low